import React from 'react';
import Tabs from '@mui/material/Tabs';
import Tab from '@mui/material/Tab';
import Box from '@mui/material/Box';
import { a11yProps, TabPanel } from 'components/common/modal/TabPanel';

const DoiDinDangModal = () => {
  const [value, setValue] = React.useState(0);

  const handleChange = (event: React.SyntheticEvent, newValue: number) => {
    setValue(newValue);
  };

  return (
    <Box
      sx={{
        flexGrow: 1,
        bgcolor: 'background.paper',
        display: 'flex',
        height: '50vh',
      }}
    >
      <Tabs
        value={value}
        orientation='vertical'
        onChange={handleChange}
        aria-label='Vertical tabs example'
        sx={{ borderRight: 1, borderColor: 'divider' }}
        TabIndicatorProps={{ style: { backgroundColor: '#14B8A6', color: '#999' } }}
      >
        <Tab label='ข้อมูลสถานที่' {...a11yProps(0)} />
        <Tab label='สิ่งก่อสร้าง' {...a11yProps(1)} />
        <Tab label='การเดินทาง' {...a11yProps(2)} />
      </Tabs>

      <TabPanel value={value} index={0}>
        <h2 className='sukhumvit-semibold mb-2'>ข้อมูลสถานที่</h2>
        ก่อตั้งเมื่อปี พ.ศ. 2534 โดย อาจารย์สมลักษณ์ ปันติบุญ ศิลปินเซรามิกระดับนานาชาติ
        บนเนื้อที่กว่า9 ไร่ ดอยดินแดงเต็มไปด้วยความร่มรื่นของต้นไม้ที่มีอยู่ทั่วบริเวณช่วยให้อากาศ
        เย็นสบายตลอดทั้งวันส่วนตัวอาคารถูกสร้างขึ้นให้สอดคล้องกับสิ่งแวดล้อม มีการนำสีแดง
        ของดินผสมเข้าไปในปูนเป็นผนังโทนอุ่น จนทำให้หลายคนคิดว่าเป็นบ้านดิน นอกจากจะทำให้
        เกิดความสวยงามแล้วการใช้ดินผสมลงในปูนยังช่วยให้ประหยัดและเกิดความแข็งแรง อีกด้วย
        <img src='' alt='' />
      </TabPanel>
      <TabPanel value={value} index={1}>
        <h2 className='sukhumvit-semibold mb-2'>สิ่งก่อสร้าง</h2>
        ภายในตัวอาคารแบ่งเป็นสัดส่วนได้แก่ โรงปั้นมีการสาธิตผลิตเครื่องปั้นดินเผา และยังเปิด
        โอกาสให้นักท่องเที่ยวได้ชมการทำงานจริง อีกทั้งสามารถสอบถามพูดคุยกับช่างได้อย่างใกล้ชิด
        การปั้นที่นี่เป็นแบบโบราณขึ้นรูปด้วยมือ การปั้น เผา เคลือบ เป็นมิตรกับสิ่งแวดล้อม ทำให้กลาย
        เป็นจุดเด่นของเครื่องปั้นที่ดอยดินแดง ส่งผลให้นักเรียน นักศึกษา และผู้สนใจ ติดต่อเข้าชม
        การทำงานอยู่แทบทุกวัน ดอยดินแดง จึงไม่ขาดผู้มาเยือน บริเวณโรงปั้น
        มีการสาธิตผลิตเครื่องปั้นดินเผา และยังเปิดโอกาสให้นักท่องเที่ยวได้ชมการ ทำงานจริง
        เครื่องปั้นดินเผาของที่นี่ ใช้ส่วนผสมจากธรรมชาติหาได้ในท้องถิ่น โดยคำนึงถึง ความปลอดภัย
        การใช้งานและมีคุณค่าทางศิลปะ โดยเฉพาะสีและผิวของเครื่องปั้นดินเผา ล้วน
        เป็นวัตถุดิบที่มาจากธรรมชาติ เช่นสีฟ้าก็ได้จากขี้เถ้าฟาง ขี้เถ้าไม้ไผ่
        นับเป็นศิลปะร่วมสมัยเหมาะ สำหรับตกแต่งบ้านและใช้งานได้จริง
        ถัดมาส่วนสตูดิโอเป็นห้องจัดแสดงงานเซรามิคอาร์ต ที่จัดวางอย่างเป็นระเบียบ
        สามารถเดินเสพความงามของงานศิลปะที่อยู่เบื้องหน้า เป็นงาน
        ศิลปะที่เกิดจากดินผ่านขั้นตอนทางความคิดถ่ายทอดออกมาได้อย่างงดงาม งานเซรามิคของ
        ดอยดินแดงแบ่งออกเป็น 2 ลักษณะ คือ 1. งานเซรามิคประเภทเครื่องถ้วย จาน ชาม บนโต๊ะอาหาร
        รวมถึงแจกัน กระถางเครื่องประดับ-ตกแต่งอาคาร 2. ผลงานศิลปะที่แฝงด้วยความรู้สึก จินตนาการ
        และเทคนิคเฉพาะ เมื่อเดินชมงานศิลปะเสร็จ อยากซื้อผลงานติดไม้ติดมือ ที่นี่ก็มี ให้ได้เลือกซื้อ
        มีทั้งจาน ชาม ของใช้ของตกแต่งบ้านต่างๆ มากมาย
      </TabPanel>
      <TabPanel value={value} index={2}>
        <h2 className='sukhumvit-semibold mb-2'>การเดินทาง</h2>
        ระยะทางประมาณ 6 กม.จากสนามบินเชียงรายมุ่งหน้าไป อ.แม่สาย จะอยู่ด้านขวามือซอย
        เดียวกับหมู่บ้านกะเหรี่ยงคอยาว เข้าไปประมาณ 2 กม.
      </TabPanel>
    </Box>
  );
};

export default DoiDinDangModal;
